Revit 2024 API
BuiltInFailures.KeyBasedTreeEntryFailures.CircularParentage Property
 A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularParentage { get; }
Visual Basic
Public Shared ReadOnly Property CircularParentage As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularParentage {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace